/*2152988 计科 杨恺铭*/
#include <iostream>
#include<iomanip>
#include<conio.h>
using namespace std;

/* 可根据需要添加相应的内容 */
/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int sum_of_square(int n)
{ 
	if (1 == n)
		return 1;
	return n * n + sum_of_square(n - 1);
}
/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/

int main()
{
	cout << "求1^2+2^2+...+n^2，请输入n值[3..1860]" << endl;
	int n;
	cin >> n;
	int sum=sum_of_square(n);
	cout <<"1^2+2^2+...+"<<n<<"^2="<<sum<< endl;
	
	return 0;
}
